app/views/shortest_paths/detail.html.erb

SELECT "visits".* FROM "visits" WHERE "visits"."shortest_path_id" = ?  [["shortest_path_id", 1]]
---
      <tbody>
        <% @shortest_path.visits.each do |detail| %>