app/views/shortest_paths/index.html.erb

SELECT "shortest_paths".* FROM "shortest_paths"
---
<% shortest_path = ShortestPath.new %>
<% shortest_path.shortestpath = (0...6).map { ('a'..'z').to_a[rand(26)] }.join %>