app/controllers/shortest_paths_controller.rb

INSERT INTO "shortest_paths" ("name", "description", "shortestpath", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @shortest_path = ShortestPath.new(shortest_path_params)
    @shortest_path.user_id = current_user.id

    respond_to do |format|
      if @shortest_path.save

UPDATE "shortest_paths" SET "description" = ?, "updated_at" = ? WHERE "shortest_paths"."id" = ?  [["description", "http://www.google.com"], ["updated_at", "2021-01-02 17:28:14.632514"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @shortest_path.update(shortest_path_params)

DELETE FROM "shortest_paths" WHERE "shortest_paths"."id" = ?  [["id", 3]]
---
  def destroy
    @shortest_path.destroy

SELECT "shortest_paths".* FROM "shortest_paths" WHERE "shortest_paths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "shortest_paths".* FROM "shortest_paths" WHERE "shortest_paths"."shortestpath" = ? LIMIT ?  [["shortestpath", "qafjgp"], ["LIMIT", 1]]
INSERT INTO "visits" ("ip_conn", "shortest_path_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ip_conn", "127.0.0.1"], ["shortest_path_id", 1], ["created_at", "2021-01-02 19:04:52.432929"], ["updated_at", "2021-01-02 19:04:52.432929"]]
SELECT "visits".* FROM "visits" WHERE "visits"."ip_conn" = ? AND "visits"."shortest_path_id" = ? LIMIT ?  [["ip_conn", "127.0.0.1"], ["shortest_path_id", 1], ["LIMIT", 1]]
UPDATE `visits` SET `visits`.`user_agent` = 'Mozilla/5.0 (Macintosh; Intel Mac OS X 11_2_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/87.0.4280.88 Safari/537.36', `visits`.`operating_system` = 'darwin20.2.0', `visits`.`amount_visits` = 1, `visits`.`updated_at` = '2021-01-02 20:59:13.265935' WHERE `visits`.`id` = 1
---
    def set_shortest_path
      if params[:id].to_i != 0
        @shortest_path = ShortestPath.find(params[:id])
      else
        @shortest_path = ShortestPath.find_by( shortestpath: params[:id] )
        str_ip = request.remote_ip.to_s

        visit = Visit.find_or_create_by( :ip_conn => str_ip, :shortest_path_id => @shortest_path.id)
        visit.amount_visits = 0 if visit.amount_visits.nil?
        visit.user_agent = request.user_agent
        visit.amount_visits += 1
        visit.operating_system = RbConfig::CONFIG["host_os"]
        visit.save