app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Ernesto PC', 'ernesto.p11@gmail.com', '$2a$12$Eml75LJZ9oI7YdJS0a5SLeHmLvVxd.gSQKJj03R9ESGLtDaHMsd66', '2021-01-02 20:58:35.471626', '2021-01-02 20:58:35.471626')
---
  def create
    @user = User.new(user_params)
    if @user.save